In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {"name":['Harry', 'Rohan', 'Gomati', 'Shubh'],
         "marks":[12, 34, 24, 67],
         "city":['Rampur', 'Kolkata', 'Bareilly', 'Chetanpur']
         }

In [3]:
df = pd.DataFrame(dict1) #it will show data in tabular form

In [4]:
df

     name  marks       city
0   Harry     12     Rampur
1   Rohan     34    Kolkata
2  Gomati     24   Bareilly
3   Shubh     67  Chetanpur

In [18]:
df.to_csv('colleague.csv',index=False) #excel sheet is created

In [19]:
colleague = pd.read_csv('colleague.csv') #excel sheet read in python

In [20]:
colleague

     name  marks       city
0   Harry     12     Rampur
1   Rohan     34    Kolkata
2  Gomati     24   Bareilly
3   Shubh     67  Chetanpur

In [21]:
colleague['marks'] #only column marks

0    12
1    34
2    24
3    67
Name: marks, dtype: int64

In [22]:
colleague['marks'][0] #particular index value

12

In [23]:
colleague['marks'][0] = 60 #it will give a warning but the value is changed

C:\Users\shahd\AppData\Local\Temp\ipykernel_15744\1557041505.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  colleague['marks'][0] = 60 #it will give a warning but the value is changed

In [24]:
colleague #u can observe that the value is changed of the harry marks which is index = 0

     name  marks       city
0   Harry     60     Rampur
1   Rohan     34    Kolkata
2  Gomati     24   Bareilly
3   Shubh     67  Chetanpur

In [25]:
colleague.index = ['first', 'second', 'third', 'fourth']

In [26]:
colleague

          name  marks       city
first    Harry     60     Rampur
second   Rohan     34    Kolkata
third   Gomati     24   Bareilly
fourth   Shubh     67  Chetanpur

In [27]:
colleague.head(2) #it will show the first 2 rows

         name  marks     city
first   Harry     60   Rampur
second  Rohan     34  Kolkata

In [28]:
colleague.tail(2) #it will show the last 2 rows

          name  marks       city
third   Gomati     24   Bareilly
fourth   Shubh     67  Chetanpur

In [29]:
colleague.describe()

           marks
count   4.000000
mean   46.250000
std    20.532495
min    24.000000
25%    31.500000
50%    47.000000
75%    61.750000
max    67.000000

# Now trying a random dataframe

In [32]:
newdf = pd.DataFrame(np.random.rand(300,5), index=np.arange(300))

In [33]:
newdf.head()

          0         1         2         3         4
0  0.281377  0.381948  0.655469  0.234419  0.755503
1  0.584014  0.953674  0.906885  0.332998  0.833927
2  0.624723  0.535722  0.463796  0.192147  0.189628
3  0.778162  0.890119  0.379607  0.612814  0.305964
4  0.416882  0.038845  0.671113  0.199393  0.273046

In [34]:
type(newdf)

pandas.core.frame.DataFrame

In [35]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [36]:
newdf.T # transpose

,0,1,2,3,4,5,6,7,8,9,...,290,291,292,293,294,295,296,297,298,299
0,0.281377,0.584014,0.624723,0.778162,0.416882,0.193981,0.602480,0.701822,0.880058,0.787384,...,0.208154,0.102082,0.632572,0.758896,0.915211,0.208958,0.809059,0.839895,0.062530,0.325325
1,0.381948,0.953674,0.535722,0.890119,0.038845,0.773435,0.338400,0.011816,0.508214,0.644822,...,0.991238,0.279074,0.017216,0.041211,0.445028,0.344665,0.475660,0.490723,0.656663,0.692247
2,0.655469,0.906885,0.463796,0.379607,0.671113,0.024016,0.187922,0.081409,0.200939,0.799653,...,0.429346,0.863124,0.134261,0.862722,0.148718,0.410442,0.330549,0.169919,0.298647,0.361057
3,0.234419,0.332998,0.192147,0.612814,0.199393,0.634052,0.355529,0.129092,0.376615,0.758772,...,0.256711,0.941449,0.771951,0.690328,0.094752,0.219611,0.693322,0.408203,0.514188,0.712213
4,0.755503,0.833927,0.189628,0.305964,0.273046,0.024760,0.497209,0.587296,0.638864,0.074057,...,0.182644,0.849663,0.483186,0.241205,0.459140,0.859233,0.876962,0.602334,0.979924,0.805773

In [39]:
newdf.loc[0,0]='harry'

In [40]:
newdf

            0         1         2         3         4
0       harry  0.381948  0.655469  0.234419  0.755503
1    0.584014  0.953674  0.906885  0.332998  0.833927
2    0.624723  0.535722  0.463796  0.192147  0.189628
3    0.778162  0.890119  0.379607  0.612814  0.305964
4    0.416882  0.038845  0.671113  0.199393  0.273046
..        ...       ...       ...       ...       ...
295  0.208958  0.344665  0.410442  0.219611  0.859233
296  0.809059  0.475660  0.330549  0.693322  0.876962
297  0.839895  0.490723  0.169919  0.408203  0.602334
298   0.06253  0.656663  0.298647  0.514188  0.979924
299  0.325325  0.692247  0.361057  0.712213  0.805773

[300 rows x 5 columns]

In [42]:
newdf.columns = list("ABCDE")
newdf

            A         B         C         D         E
0       harry  0.381948  0.655469  0.234419  0.755503
1    0.584014  0.953674  0.906885  0.332998  0.833927
2    0.624723  0.535722  0.463796  0.192147  0.189628
3    0.778162  0.890119  0.379607  0.612814  0.305964
4    0.416882  0.038845  0.671113  0.199393  0.273046
..        ...       ...       ...       ...       ...
295  0.208958  0.344665  0.410442  0.219611  0.859233
296  0.809059  0.475660  0.330549  0.693322  0.876962
297  0.839895  0.490723  0.169919  0.408203  0.602334
298   0.06253  0.656663  0.298647  0.514188  0.979924
299  0.325325  0.692247  0.361057  0.712213  0.805773

[300 rows x 5 columns]

In [44]:
newdf.iloc[0,4]

0.755503442896595

In [45]:
newdf.iloc[[0,4],[1,2]]

          B         C
0  0.381948  0.655469
4  0.038845  0.671113